import { Injectable } from '@nestjs/common';
import { InjectRepository } from '@nestjs/typeorm';
import { Craft, CraftDocument } from './craft.schema';
import { Model } from 'mongoose';
import { InjectModel } from '@nestjs/mongoose';

@Injectable()
export class CraftService {
  constructor(
    @InjectModel(Craft.name) private readonly craftModel: Model<CraftDocument>,
  ) {}

  async findAll() {
    return this.craftModel.find().populate('city');
  }

  async create() {
    const datas = [
      {
        city: '629e05958f95e319fb6cfcdb' /*اردبیل*/,
        desc: `خراطی به هنری گفته می‌شود که در آن چوب را با استفاده از حرکت دورانی می‌تراشند و آن را با ایجاد خراشیدگی و فرورفتگی شکل می‌دهند. در خراطی هرچه چوب فشرده‌تر و محکم‌تر باشد محصول ظریف‌تر و بادوام‌تر است.
هنرمندان خراط اردبیلی با استفاده از چوب درخت‌های گردو، زبان گنجشک، نارون و توسکا وسایلی مثل عصا، وردنه، قلیان، مبلمان، میز، آباژور و صندلی را می‌سازند.مردم سرعین در استان اردبیل اصلی ترین طرفداران خراطی هستند.
ملیله کاری`,
        title: 'خراطی',
        slug: 'kharati',
      },
      {
        city: '629e05958f95e319fb6cfcdb' /*اردبیل*/,
        desc: `ملیله‌کاری یکی از صنایع دستی اردبیل است و به هنر ساخت زیورآلات، ظرف‌ها و اشیاء زینتی با استفاده از فلز و مفتول‌هایی از جنس طلا، نقره و مس گفته می‌شود. آثار به‌جامانده از این هنر نشان می‌دهد قدمتی سه‌هزار ساله دارد و از قدیمی‌ترین روش‌های ساخت زیورآلات به شمار می‌رود
سراجی`,
        title: 'ملیله کاری',
        slug: 'malile-kari',
      },
      {
        city: '629e05958f95e319fb6cfcdc' /*اصغحان*/,
        desc: `
        این صنعت از کنار هم قرار دادن تکه‌های کوچک سنگ فیروزه بروی اجسامی همانند انواع ظروف، گلدان‌ها و حتی زیورآلات درست می‌شود. در این هنر تکه‌های کوچک فیروزه بروی سطوح این اشیا قرارگرفته و زیبایی آن‌ها را چندین برابر می‌کند. پس از کنار هم قرار گرفتن قطعات فیروزه، بین آن‌ها نوعی لاک تیره قرار داده تا فضای خالی میان آن‌ها پر شود. مراحل ساخت و انجام این هنر شامل (زرگری، فیروزه کوبی، پرداخت‌کار) است تا محصول نهایی آماده و راهی بازار شود
نقره سازی
`,
        title: 'فیروزه کوبی',
        slug: 'firooze-koobi',
      },
      {
        city: '629e05958f95e319fb6cfce3' /*مشهد*/,
        desc: `
        این صنعت از کنار هم قرار دادن تکه‌های کوچک سنگ فیروزه بروی اجسامی همانند انواع ظروف، گلدان‌ها و حتی زیورآلات درست می‌شود. در این هنر تکه‌های کوچک فیروزه بروی سطوح این اشیا قرارگرفته و زیبایی آن‌ها را چندین برابر می‌کند. پس از کنار هم قرار گرفتن قطعات فیروزه، بین آن‌ها نوعی لاک تیره قرار داده تا فضای خالی میان آن‌ها پر شود. مراحل ساخت و انجام این هنر شامل (زرگری، فیروزه کوبی، پرداخت‌کار) است تا محصول نهایی آماده و راهی بازار شود
نقره سازی
`,
        title: 'ارغوان بافی مشهد',
        slug: 'arghavan-bafi',
      },
    ];
    const promises = datas.map((craft) => this.craftModel.create(craft));
    return Promise.all(promises);
  }
}
