import { Injectable } from '@nestjs/common';
import { MongoRepository } from 'typeorm';
import { City, CityDocument } from './city.schema';
import { InjectModel } from '@nestjs/mongoose';
import { Craft, CraftDocument } from '../craft/craft.schema';
import { Model } from 'mongoose';

@Injectable()
export class CityService {
  constructor(
    @InjectModel(City.name)
    private cityRepository: Model<CityDocument>,
  ) {}

  async findAll(): Promise<City[]> {
    return this.cityRepository.find();
  }

  async create() {
    const array = [
      { name: 'آذربایجان شرقی', desc: '' },
      { name: 'آذربایجان غربی', desc: '' },
      {
        name: 'اردبیل',
        desc: `ملیله‌کاری یکی از صنایع دستی اردبیل است و به هنر ساخت زیورآلات، ظرف‌ها و اشیاء زینتی با استفاده از فلز و مفتول‌هایی از جنس طلا، نقره و مس گفته می‌شود. آثار به‌جامانده از این هنر نشان می‌دهد قدمتی سه‌هزار ساله دارد و از قدیمی‌ترین روش‌های ساخت زیورآلات به شمار می‌رود`,
      },
      {
        name: 'اصفهان',
        desc: `نقره سازی در اصفهان از دیرباز موردتوجه بوده و هست. در کنار ساخت انواع ظروف نقره‌کارهای دیگری ازجمله قلم‌زنی نیز بروی انواع ظروف نقره انجام می‌شوند.`,
      },
      { name: 'البرز', desc: '' },
      { name: 'ایلام', desc: '' },
      { name: 'بوشهر', desc: '' },
      { name: 'تهران', desc: '' },
      { name: 'چهارمحال و بختیاری', desc: '' },
      { name: 'خراسان جنوبی', desc: '' },
      {
        name: 'خراسان رضوی',
        desc: `سنگ تراشی، صنعت دست مشهد – از قدیمی ترین و البته اصیل ترین صنایع دستی مشهد است که قدمت آن به قرن 14 ام برمیگردد، حتی تماشای قلم کاری کردن و طرح و نقش انداختن بر روی دیگ ها و ظروف سنکی بسیار جذاب است
فیروزه تراشی مشهد`,
      },
      { name: 'خراسان شمالی', desc: '' },
      { name: 'خوزستان', desc: '' },
      {
        name: 'زنجان',
        desc: `فرش و گليم و جاجيم زنجان از معروفيت خاصي برخوردارند . فرش بافي در زنجان يكي از صنايع با قدمت زياد است كه نقش قابل توجهي در صادرات فرش ايران ايفا ميكند . فرشهاي صادراتي زنجان از بهترين جلوه هاي فرهنگي اين استان هستند`,
      },
      { name: 'سمنان', desc: '' },
      { name: 'سیستان و بلوچستان', desc: '' },
      { name: 'فارس', desc: '' },
      { name: 'قزوین', desc: '' },
      { name: 'قم', desc: '' },
      { name: 'کردستان', desc: '' },
      {
        name: 'کرمان',
        desc: `
کرمان یکی از شهرهای تاریخی مرکز ایران است که جاذبه های دیدنی فراوانی دارد. این شهر جزو تاریخی ترین شهرها به شمار می رود و مناطق آب و هوایی بسیار زیبا و کویری دارد، مردمان این شهر بسیار خونگرم و مهمان نواز هستند و ارتباط بسیار نزدیکی با گردشگران دارند.
معرق کاری چوب`,
      },
      { name: 'کرمانشاه', desc: '' },
      { name: 'کهگیلویه و بویراحمد', desc: '' },
      { name: 'گلستان', desc: '' },
      { name: 'گیلان', desc: '' },
      { name: 'لرستان', desc: '' },
      { name: 'مازندران', desc: '' },
      { name: 'مرکزی', desc: '' },
      { name: 'هرمزگان', desc: '' },
      { name: 'همدان', desc: '' },
      {
        name: 'یزد',
        desc: `در هنر کاشی سازی، یزدی‌ها از طرح‌های سنتی و اصیل ایرانی استفاده می‌کنند و کاشی‌هایی زیبا تولید می‌کنند که در معماری بناها جلوه‌ای ویژه دارد. قد`,
      },
    ];
    const promises = array.map((city) => this.cityRepository.create(city));
    return Promise.all(promises);
  }
}
